Repository: pranavpandey1998official/union
Catalog: lib/l10n/app_*.arb
Languages: fi, sv

source: About
fi: Tietoja

# account
source: {count, plural, zero {Account} one {Account} other {Accounts} }
fi: Tili
sv: Konto

source: Account Settings
fi: Tiliasetukset
sv: Kontoinställningar

source: Actions
fi: Toiminnot
sv: Aktioner

source: Active
fi: Aktiiviset
sv: Aktiva

source: Add
fi: Lisää
sv: Lägg till

source: Add Account
fi: Lisää Tili
sv: Lägg till Konto

# addAccountToSeeProfile
source: Log in to see your account.
fi: Lisää tili nähdäksesi profiilisi.
sv: Lägg till ett konto för att se din profil.

source: Add Anonymous Instance
fi: Lisää Anonyymi Instanssi
sv: Lägg till Anonym Instans

# addKeywordFilter
source: Add Keyword
fi: Lisää avainsana

source: Add to favorites
fi: Lisää suosikkeihin

# addedCommunityToSubscriptions
source: Subscribed to community
fi: Yhteisö lisätty tilauksiin

source: Advanced
fi: Lisäasetukset

source: All
fi: Kaikki

source: All Posts
fi: Kaikki Postaukset
sv: Alla Inlägg

# allowOpenSupportedLinks
source: Allow app to open supported links.
fi: Salli sovelluksen avata tuettuja linkkejä.

source: Already posted to
fi: Postattu jo yhteisöön
sv: Redan inlagd till

# andXMore
source: and {count} more
fi: ja {count} lisää
sv: och {count} till

source: Animations
fi: Animaatiot

source: Anonymous
fi: Anonyymi
sv: Anonym

source: App Language
fi: Sovelluksen kieli

source: Appearance
fi: Ulkoasu

source: Applied
fi: Käytössä

source: Apply
fi: Käytä

source: Back
fi: Takaisin
sv: Tillbaka

source: Back button
fi: Takaisin-painike

source: Back To Top
fi: Takaisin Ylös
sv: Tillbaka Upp

source: Block Community
fi: Estä Yhteisö
sv: Blockera community

source: Block Instance
fi: Estä Instanssi
sv: Blockera instans

source: Block User
fi: Estä Käyttäjä
sv: Blockera användare

source: Blocked Communities
fi: Estetyt Yhteisöt
sv: Blockerade Gemenskaper

source: Blocked Instances
fi: Estetyt Instanssit
sv: Blockerade Instanser

source: Blocked Users
fi: Estetyt Käyttäjät
sv: Blockerade Användare

# browsingAnonymously
source: You are currently browsing {instance} anonymously.
fi: Selaat instanssia, {instance}, anonyymisti.
sv: Du bläddrar nu i {instance} anonymt.

source: Cancel
fi: Peru
sv: Avbryt

# cannotReportOwnComment
source: You may not submit a report for your own comment.
fi: Et voi ilmiantaa omaa kommenttiasi.

# cantBlockAdmin
source: You may not block an instance administrator.
fi: Et voi estää instanssin ylläpitäjää.

# cantBlockYourself
source: You may not block yourself.
fi: Et voi estää itseäsi.
sv: Du kan inte blockera dig själv.

source: Card View
fi: Korttinäkymä

# cardViewDescription
source: Enable card view to adjust settings
fi: Ota korttinäkymä käyttöön säätääksesi asetuksia

source: Card View Settings
fi: Korttinäkymän asetukset

source: Change Sort
fi: Vaihda Lajittelu
sv: Ändra Sortering

source: Clear Database
fi: Tyhjennä tietokanta

source: Clear Search
fi: Tyhjennä Hakukenttä
sv: Töm Sökfältet

# clearedDatabase
source: Local database cleared. Restart Thunder for new changes to take effect.
fi: Paikallinen tietokanta tyhjennetty. Uudelleenkäynnistä Thunder nähdäksesi muutokset.

source: Close
fi: Sulje
sv: Stäng

source: Collapse Comment Preview
fi: Lyyhistä kommentin esikatselu

source: Collapse post
fi: Lyyhistä postaus

source: Collapse Post Preview
fi: Lyyhistä postauksen esikatselu

# combineCommentScoresLabel
source: Combine Comment Scores
fi: Yhdistä kommenttipisteet

# combineNavAndFab
source: Combine FAB and Navigation Buttons
fi: Kelluva toimintopainike näytetään navigointipainikkeiden välissä.

source: Comment
fi: Kommentti

# commentBehaviourSettings
source: Comments
fi: Kommentit

# commentPreview
source: Show a preview of the comments with the given settings
fi: Näytä kommenttien esikatselu määritetyillä asetuksilla

# commentReported
source: The comment has been marked for review.
fi: Kommentti merkitty tarkistusta varten.

source: Comment saved as draft
fi: Kommentin luonnos tallennettu
sv: Kommentar sparad som utkast

# commentShowUserInstance
source: Show User Instance
fi: Näytä käyttäjän instanssi

source: Comment Sort Type
fi: Kommenttien lajittelun tyyppi

# commentSwipeGesturesHint
source: Looking to use buttons instead? Enable them in the comments section in general settings.
fi: Haluatko käyttää mielummin painikkeita? Ota ne käyttöön yleisten asetusten kommenttiosiossa.

source: Comments
fi: Kommentit

source: Communities
fi: Yhteisöt
sv: Gemenskaper

source: Community
fi: Yhteisö

source: Community Format
fi: Yhteisön formaatti

source: Compact View
fi: Kompakti näkymä

# compactViewDescription
source: Enable compact view to adjust settings
fi: Ota kompakti näkymä käyttöön säätääksesi asetuksia

source: Compact View Settings
fi: Kompaktin näkymän asetukset

# confirmLogOutBody
source: Are you sure you want to log out?
fi: Oletko varma, että haluat kirjautua ulos?

# confirmLogOutTitle
source: Log Out?
fi: Kirjaudu ulos?

# confirmMarkAllAsReadBody
source: Are you sure you want to mark all messages as read?
fi: Oletko varma, että haluat merkitä kaikki viestit luetuiksi?

# confirmMarkAllAsReadTitle
source: Mark All As Read?
fi: Merkitse kaikki luetuiksi?

source: Copied to clipboard
fi: Kopioitu leikepöydälle

source: Copy
fi: Kopioi

source: Copy Text
fi: Kopioi teksti

source: {count} subscribers
fi: {count} tilaajaa
sv: {count} prenumeranter

source: Create Account
fi: Luo Tili
sv: Skapa Konto

source: Create Comment
fi: Luo kommentti

source: Create new cross-post
fi: Luo uusi ristiinjulkaisu
sv: Skapa ett nytt tvärinlägg

source: Create Post
fi: Luo Postaus
sv: Skapa Inlägg

source: Cross-posted to
fi: Ristiinjulkaistu yhteisöön
sv: Tvärinlägg till

# customizeSwipeActions
source: Customize swipe actions (tap to change)
fi: Mukauta pyyhkäisytoimintoja (napauta muuttaaksesi)

source: Debug
fi: Virheenjäljitys

# debugDescription
source: The following debug settings should only be used for troubleshooting purposes.
fi: Seuraavia vianmääritysasetuksia tulisi käyttää ainoastaan vianetsintätarkoituksiin.

source: Delete
fi: Poista

source: Dim Read Posts
fi: Luetut postaukset näkyvät tummennettuina

source: Dismiss Read
fi: Hylkää Luetut
sv: Avfärda Lästa

# displayUserScore
source: Display User Scores (Karma).
fi: Näytä käyttäjäpisteet (Karma).

# downloadingMedia
source: Downloading media to share…
fi: Ladataan mediaa jaettavaksi…

source: Edit
fi: Muokkaa

source: Edit Comment
fi: Muokkaa kommenttia

source: Edit Post
fi: Muokkaa postausta

source: Empty
fi: Tyhjä
sv: Tom

source: Empty Inbox
fi: Tyhjä postilaatikko

source: End Search
fi: Lopeta haku

# errorDownloadingMedia
source: Could not download the media file to share: {errorMessage}
fi: Mediatiedostoa ei voitu ladata jaettavaksi: {errorMessage}

# exceptionProcessingUri
source: An error occurred while processing the link. It may not be available on your instance.
fi: Linkin käsittelyssä tapahtui virhe. Se ei ehkä ole saatavilla instanssillasi.

source: Expand Comment Preview
fi: Laajenna kommentin esikatselu

source: Expand options
fi: Laajenna asetukset

source: Expand post
fi: Laajenna postaus

source: Expand Post Preview
fi: Laajenna postauksen esikatselu

# failedToBlock
source: Failed to block: {errorMessage}
fi: Estäminen epäonnistui: {errorMessage}

# failedToUnblock
source: Could not unblock: {errorMessage}
fi: Eston poisto epäonnistui: {errorMessage}

source: Favorites
fi: Suosikit

source: Feed
fi: Julkaisut
sv: Flöde

# feedBehaviourSettings
source: Feed
fi: Syöte

# fetchAccountError
source: Could not determine account
fi: Tiliä ei voitu määritellä

source: Filters
fi: Suodattimet

source: General
fi: Yleiset

source: General Settings
fi: Yleiset asetukset

source: Gestures
fi: Eleet

source: Getting Started
fi: Aloitus
sv: Kom Igång

source: Hide Password
fi: Piilota Salasana
sv: Dölj Lösenord

source: Hot
fi: Kuumat
sv: Heta

source: Image
fi: Kuva

source: Import/Export Settings
fi: Tuo/vie asetukset

source: Import Settings
fi: Tuo asetukset

source: Inbox
fi: Postilaatikko

source: Instance
fi: Instanssi
sv: Instans

# instanceHasAlreadyBenAdded
source: {instance} has already been added.
fi: {instance} on jo lisätty.
sv: {instance} har redan blivit tillagd.

# internetOrInstanceIssues
source: You may not be connected to the Internet, or your instance may be currently unavailable.
fi: Internet yhteys puuttuu, tai valitsemasi instanssi ei ole nyt saatavilla.
sv: Det kan vara problem med din internetanslutning, eller så är din instans inte tillgänglig.

source: Language
fi: Kieli

# linksBehaviourSettings
source: Links
fi: Linkit

# loadMorePlural
source: Load {count} more replies…
fi: Lataa {count} vastausta lisää…
sv: Ladda in {count} svar till…

# loadMoreSingular
source: Load {count} more reply…
fi: Lataa {count} vastausta lisää…
sv: Ladda in {count} svar till…

source: Local Posts
fi: Paikalliset Postaukset
sv: Lokala Inlägg

source: Log out
fi: Kirjaudu Ulos
sv: Logga ut

source: Log in
fi: Kirjaudu
sv: Logga in

# loginFailed
source: Could not log in. Please try again:({errorMessage})
fi: Kirjautuminen epäonnistui. Ole hyvä ja yritä uudelleen: ({errorMessage})

# loginToPerformAction
source: You need to be logged in to carry out this task.
fi: Sinun on kirjauduttava sisään suorittaaksesi tämän toiminnon.

# loginToSeeInbox
source: Log in to see your inbox
fi: Kirjaudu nähdäksesi postilaatikkosi

source: Manage Accounts
fi: Hallitse Tilejä
sv: Hantera Konton

# missingErrorMessage
source: No error message available
fi: Ei vikailmoitusta
sv: Inget felmeddelande

source: Most Comments
fi: Eniten Kommentteja
sv: Mest Kommenterat

# mustBeLoggedInComment
source: You need to be logged in to comment
fi: Sinun tulee olla kirjautunut kommentoidaksesi

# mustBeLoggedInPost
source: You need to be logged in to create a post
fi: Sinun tulee olla kirjautunut luodaksesi postauksen

# navigateUp
source: Previous comment
fi: Edellinen kommentti
sv: Föregående kommentar

source: Navigation
fi: Navigaatio

source: New Comments
fi: Uusimmat Kommentit
sv: Nya Kommentarer

source: New
fi: Uusimmat
sv: Nya

# noComments
source: Oh. There are no comments.
fi: Höh. Ei yhtään kommenttia.

source: No communities found.
fi: Ei löytynyt yhteisöjä
sv: Inga gemenskaper hittades

# noCommunityBlocks
source: No blocked communities.
fi: Ei estettyjä yhteisöjä.
sv: Inga blockerade gemenskaper.

# noInstanceBlocks
source: No blocked instances.
fi: Ei estettyjä instansseja.
sv: Inga blockerade instanser.

# noPosts
source: No posts found.
fi: Postauksia ei löytynyt
sv: Inga inlägg

# noUserBlocks
source: No blocked users.
fi: Ei estettyjä käyttäjiä.
sv: Inga blockerade användare.

source: No users found.
fi: Ei löytynyt käyttäjiä
sv: Inga användare hittades

# notValidLemmyInstance
source: {instance} does not appear to be a valid Lemmy instance
fi: {instance} ei ole kelvollinen Lemmy instanssi
sv: {instance} verkar ej vara en giltig Lemmy-instans.

# notValidUrl
source: Not a valid URL
fi: Ei kelvollinen URL
sv: Inte en giltig URL

source: Nothing to share
fi: Ei mitään jaettavaa

# notificationsBehaviourSettings
source: Notifications
fi: Ilmoitukset

source: Old
fi: Vanhat
sv: Äldst

# onlyModsCanPostInCommunity
source: Only moderators may post in this community
fi: Ainoastaan moderaatorit voivat luoda postauksia tähän yhteisöön
sv: Endast en moderator kan skapa inlägg i denna gemenskap

source: Open
fi: Avaa
sv: Öppna

source: Open in Browser
fi: Avaa selaimessa

source: Open Instance
fi: Avaa Instanssi
sv: Öppna Instans

source: Overview
fi: Yhteenveto
sv: Överblick

source: Password
fi: Salasana
sv: Lösenord

# postBehaviourSettings
source: Posts
fi: Postaukset

source: Post Body
fi: Postauksen Teksti
sv: Brödtext

# postLocked
source: Post locked. No replies allowed.
fi: Postaus lukittu. Vastauksia ei sallita.

# postNSFW
source: Mark as NSFW
fi: Merkitse NSFW
sv: Markera som NSFW

source: Post saved as draft
fi: Postauksen luonnos tallennettu
sv: Inlägg sparad som utkast

# postTitle
source: Title
fi: Otsikko
sv: Tittel

# postTogglePreview
source: Toggle Preview
fi: Kytke Esikatselu
sv: Förhandsvisning

# postUploadImageError
source: Could not upload image
fi: Kuvan lataus epäonnistui
sv: Kunde inte ladda upp bild

source: Posts
fi: Postaukset
sv: Inlägg

source: Profiles
fi: Tilit
sv: Profiler

# reducesAnimations
source: Reduces the animations used within Thunder
fi: Vähentää Thunderissa käytettyjä animaatioita

source: Refresh
fi: Virkistä
sv: Uppdatera

source: Refresh Content
fi: Virkistä Sisältö
sv: Uppdatera Innehåll

source: Remove
fi: Poista
sv: ta bort

source: Remove Account
fi: Poista Tili
sv: Ta Bort Konto

source: Remove from favorites
fi: Poista suosikeista

source: Remove instance
fi: Poista instanssi
sv: Ta bort instans

source: Reply to Post
fi: Luo Kommentti
sv: Svara på Inlägg

# replyingTo
source: Replying to {author}
fi: Vastataan käyttäjälle {author}

source: Report
fi: Ilmianna

source: Report Comment
fi: Ilmianna kommentti

source: Restore
fi: Palauta

source: Restored comment from draft
fi: Kommentti palautettu luonnoksesta
sv: Kommentar återställd från utkast

source: Restored post from draft
fi: Postaus palautettu luonnoksesta
sv: Inlägg återställt från utkast

source: Save
fi: Tallenna
sv: Spara

source: Save Settings
fi: Tallenna asetukset

source: Saved
fi: Tallennettu
sv: Sparat

source: Scaled
fi: Skaalattu

# scrapeMissingPreviews
source: Enabling will have a performance hit.
fi: Tämän käyttöönotto vaikuttaa suorituskykyyn.

source: Search
fi: Haku
sv: Sök

source: Search by text
fi: Hae tekstillä
sv: Sök med text

source: Search by URL
fi: Hae URL-osoitteella
sv: Sök med URL

source: Search Comments
fi: Hae kommentteja

# searchCommunitiesFederatedWith
source: Search for communities federated with {instance}
fi: Hae yhteisöjä jotka ovat federoituja {instance} kanssa
sv: Sök efter communities federerade med {instance}

source: Search {instance}
fi: Hae {instance}
sv: Sök {instance}

source: Search term
fi: Hakusana

# searchUsersFederatedWith
source: Search for users federated with {instance}
fi: Hae käyttäjiä jotka ovat federoituja {instance} kanssa
sv: Sök användare som är federerade med {instance}

# selectCommunity
source: Select a community
fi: Valitse yhteisö
sv: Välj Gemenskap

source: Select Feed Type
fi: Valitse Julkaisulaji
sv: Välj Flödtyp

source: Select language
fi: Valitse kieli

source: Select Search Type
fi: Valitse Hakulaji
sv: Välj Söktyp

# serverErrorComments
source: A server error was encountered when fetching more comments: {message}
fi: Tapahtui palvelinvirhe haettaessa lisää kommentteja: {message}

# setLongPress
source: Set as long-press action
fi: Aseta pitkän kosketuksen toiminnoksi
sv: Ställ in för lång vidrörelse

# setShortPress
source: Set as short-press action
fi: Aseta lyhyen kosketuksen toiminnoksi
sv: Ställ in för kort vidrörelse

source: Settings
fi: Asetukset
sv: Inställningar

source: Share
fi: Jaa

source: Share Link
fi: Jaa linkki

source: Share Media
fi: Jaa media

source: Share Post
fi: Jaa postaus

source: Show All
fi: Näytä kaikki

# showLess
source: Show fewer
fi: Näytä vähemmän

source: Show more
fi: Näytä lisää

source: Show Password
fi: Näytä Salasana
sv: Visa Lösenord

source: Show Read Posts
fi: Näytä luetut postaukset

source: Sidebar
fi: Sivupalkki

# sidebarBottomNavDoubleTapDescription
source: Double-tap bottom nav to open sidebar
fi: Kaksoisnapauta alanavigointia avataksesi sivupalkin

# sidebarBottomNavSwipeDescription
source: Swipe bottom nav to open sidebar
fi: Avaa sivupalkki pyyhkäisemällä alanavigointia

# somethingWentWrong
source: Oops, something went wrong!
fi: Oi ei, jokin meni pieleen!
sv: oj något gick fel

source: Sort By
fi: Lajittelu
sv: Sortera Enligt

source: Sort Options
fi: Lajitteluasetukset
sv: Sorteringsinställningar

source: Submit
fi: Lähetä

source: Subscribe
fi: Tilaa
sv: Prenumerera

source: Subscribed
fi: Tilattu
sv: Prenumererad

source: Subscriptions
fi: Tilaukset
sv: Prenumererade

# successfullyBlocked
source: Blocked.
fi: Estetty.

source: Suggested title
fi: Otsikkoehdotus

# tapToExit
source: Press back again to exit
fi: Paina takaisin kahdesti poistuaksesi
sv: Tryck tillbaka två gånger för att stänga

source: Text
fi: Teksti

# timeoutErrorMessage
source: There was a timeout waiting for a response.
fi: Latauksen aikana tapahtui aikakatkaisu.
sv: Förfrågan nådde maxtiden.

source: Top
fi: Parhaat
sv: Bästa

# topAll
source: Top of all time
fi: Kaikkien Aikojen Ylimmät
sv: Bäst genom tiderna

# topDay
source: Top Today
fi: Päivän Ylimmät
sv: Bäst Idag

# topHour
source: Top in Past Hour
fi: Tunnin Ylimmät
sv: Bäst under Senaste Timme

source: Top Month
fi: Kuun Ylimmät
sv: Bäst denna Månad

# topNineMonths
source: Top in Past 9 Months
fi: Parhaat 9:n kuukauden ajalta

# topSixHour
source: Top in Past 6 Hours
fi: Kuuden Tunnin Ylimmät
sv: Bästa under Senaste 6 Timmarna

# topSixMonths
source: Top in Past 6 Months
fi: Parhaat 6:n kuukauden ajalta

# topThreeMonths
source: Top in Past 3 Months
fi: Parhaat 3:n kuukauden ajalta

# topTwelveHour
source: Top in Past 12 Hours
fi: Kahdentoista Tunnin Ylimmät
sv: Bästa under Senaste 12 Timmarna

source: Top Week
fi: Viikon Ylimmät
sv: Bäst denna Vecka

source: Top Year
fi: Vuoden Ylimmät
sv: Bäst detta År

# totp
source: TOTP (optional)
fi: TOTP (valinnainen)
sv: TOTP (valfri)

source: Trending Communities
fi: Kasvavat Yhteisöt
sv: Trendiga Gemenskaper

source: Unable to find community
fi: Yhteisöä ei löytynyt
sv: Kunde inte hitta gemenskap

source: Unable to find instance
fi: Instanssia ei löytynyt
sv: Kan ej hitta instans

source: Unable to find user
fi: Käyttäjää ei löytynyt
sv: Kan ej hitta användaren

source: Unable to load {instance}
fi: {instance} lataus epäonnistui
sv: Kunde ej ladda {instance}

source: Unable to load posts from {instance}
fi: Postauksien lataaminen epäonnistui {instance}
sv: Kunde ej ladda inlägg från {instance}

# unableToLoadReplies
source: Unable to load more replies.
fi: Lisää vastauksia ei voitu ladata.

source: Unexpected Error
fi: Odottamaton virhe

source: Unsubscribe
fi: Peru Tilaus
sv: Säg Upp

# unsubscribePending
source: Unsubscribe (subscription pending)
fi: Peru Tilaus (tilaus vireillä)
sv: Säg upp (prenumeration i väntan)

source: Unsubscribed
fi: Tilaus Peruttu
sv: Prenumeration Uppsagd

# updateReleased
source: Update released: {version}
fi: Päivitys on saatavilla: {version}
sv: Updatering tillgänglig: {version}

source: Upload image
fi: Lataa kuva

# uriNotSupported
source: This type of link is not supported at the moment.
fi: Tämän tyyppistä linkkiä ei tueta tällä hetkellä.

# useCompactView
source: Enable for small posts, disable for big.
fi: Ota käyttöön pienille postauksille, poista käytöstä suuremmista.

# useSuggestedTitle
source: Use suggested title: {title}
fi: Käytä ehdotettua otsikkoa: {title}

source: Username
fi: Käyttäjänimi
sv: Användarnamn

source: Users
fi: Käyttäjät
sv: Användare

source: No comments found.
sv: Inga kommentarer hittades

source: No posts found
sv: Inga inlägg hittades

# searchCommentsFederatedWith
source: Search for comments federated with {instance}
sv: Sök kommentarer federerade till {instance}

# searchPostSearchType
source: Select Post Search Type
sv: Välj Inlägg Söktyp

# searchPostsFederatedWith
source: Search for posts federated with {instance}
sv: Sök inlägg federerade till {instance}
